2024-3-14/11a943c043-STDY.org
#+INCLUDE: "../../prefix.org"

#+TITLE: 进程间通信---信号                            

信号的本质是一种进程间通信，一个进程向另一个进程发送信号。
1. 目标进程正在执行关键代码，不能被信号中断，需要阻塞某些信号，
   期间信号不允许被传递到进程，直到目标进程解除阻塞。
   1. 信号丢掉吗？
   2. 阻塞某些信号？如何选择阻塞哪些信号？
   3. 如何得知目标进程是否阻塞什么信号？
2. 内核发现同一个信号已经存在，如何处理重复信号？丢掉 or 重复？
3. 内核传递信号给目标进程时，发现已有多个不同的信号被挂起，那内核优先递送哪个信号？
4. 向多个线程的进程发送信号，应该由哪个线程负责？
5. 信号如何产生？
   1. 进程之间相互发信号。
   2. 硬件异常。
      硬件检测到了错误立即通知内核，内核发送相应的信号给相关进程。
      | 信号    | 值 | 说明                                        |
      | SIGBUS  |  7 | 总线错误，表示发生了内存访问错误。          |
      | SIGFPE  |  8 | 表示发生了算术错误，尽管FPE是浮点异常的缩写 |
      | SIGILL  |  9 | 进程尝试执行非法的机器语言指令              |
      | SIGSEGV | 11 | 段错误，表示应用程序访问了无效地址          |
      默认情况下，这四种信号都会使进程终止，并产生coredump文件以供调试。
   3. 终端相关的信号。
   4. 软件事件相关的信号。
