2024-3-14/11a943c043-STDY.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-05-22 Wed 16:46 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>进程间通信---信号</title>
<meta name="author" content="Yang" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">进程间通信---信号</h1>
<p>
信号的本质是一种进程间通信，一个进程向另一个进程发送信号。
</p>
<ol class="org-ol">
<li>目标进程正在执行关键代码，不能被信号中断，需要阻塞某些信号，
期间信号不允许被传递到进程，直到目标进程解除阻塞。
<ol class="org-ol">
<li>信号丢掉吗？</li>
<li>阻塞某些信号？如何选择阻塞哪些信号？</li>
<li>如何得知目标进程是否阻塞什么信号？</li>
</ol></li>
<li>内核发现同一个信号已经存在，如何处理重复信号？丢掉 or 重复？</li>
<li>内核传递信号给目标进程时，发现已有多个不同的信号被挂起，那内核优先递送哪个信号？</li>
<li>向多个线程的进程发送信号，应该由哪个线程负责？</li>
<li>信号如何产生？
<ol class="org-ol">
<li>进程之间相互发信号。</li>
<li><p>
硬件异常。
硬件检测到了错误立即通知内核，内核发送相应的信号给相关进程。
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-right">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">信号</td>
<td class="org-right">值</td>
<td class="org-left">说明</td>
</tr>

<tr>
<td class="org-left">SIGBUS</td>
<td class="org-right">7</td>
<td class="org-left">总线错误，表示发生了内存访问错误。</td>
</tr>

<tr>
<td class="org-left">SIGFPE</td>
<td class="org-right">8</td>
<td class="org-left">表示发生了算术错误，尽管FPE是浮点异常的缩写</td>
</tr>

<tr>
<td class="org-left">SIGILL</td>
<td class="org-right">9</td>
<td class="org-left">进程尝试执行非法的机器语言指令</td>
</tr>

<tr>
<td class="org-left">SIGSEGV</td>
<td class="org-right">11</td>
<td class="org-left">段错误，表示应用程序访问了无效地址</td>
</tr>
</tbody>
</table>
<p>
默认情况下，这四种信号都会使进程终止，并产生coredump文件以供调试。
</p></li>
<li>终端相关的信号。</li>
<li>软件事件相关的信号。</li>
</ol></li>
</ol>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yang</p>
<p class="date">Created: 2024-05-22 Wed 16:46</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
